module.exports={
  messages:{
  excelhelp:`👆👆👆
گزارش بالا را با برنامه اکسل باز کنید، اگر این برنامه را ندارید از کافه بازار ان را دانلود کنید:
goo.gl/uX9Yis
👆 لینک دانلود`,
rules:`🙂قوانین مجموعه تبلیغاتی Raz : (#حتما_بخونید)

چرا باید با مجموعه تبلیغاتی Raz کار کنید⁉️
😍  لینک گروه شات ما همیشه بازه و میتونید شات بفرستید. ما سوزوندن شات نداریم (اگه دیر شات میفرستین حتما با ادمین هماهنگ کنید)
😍    اگه شات نفرستین هم باز ویوتون توسط ادمین های ما ثبت میشه
😍    اگه زود تبلیغو بردارید و موقع شات یادتون بره شات رو بفرستین، پی وی بهتون پیام داده میشه که شات رو برسونید بهمون که واستون ثبت بشه
😍    دقیق ترین واریزی ها رو داریم و سوابق واریز به شما در کانال واریزی ما کاملا مشخصه (ادرس کانال واریز : 
https://t.me/joinchat/AAAAAD-8CXg2k40Oo9cBsg
)
😍    تمامی تبلیغاتی که در مجموعه ما شرکت میکنید ثبت میشه و در اکثر شرایط حتی اگه شات رو اشتباها پاک کنید بر اساس سوابقی که دارین بدون شات واستون لحاظ میکنیم (به شرطی که مشتری شات نخواد ازمون و شما هم از همیشگی های مجموعه ما باشید)
😍    اگه شک و شبهه ای در خصوص تبلیغاتی که زدین و واریزی هاتون داشته باشید همه جزییات همکاری برای شما ارسال میشه
😍    تبلیغات ما عمدتا سازمانی هستند وبهترین بنرها رو تو مجموعه ما پیدا میکنید.
〰〰〰〰〰〰〰

کیا نمیتونن با ما کار کنن⁉️

😡  کسایی که تبادلات غیر اخلاقی میزنن و پست های غیر اخلاقی دارن (بار اول و دوم تذکر میدیم، بار سوم و چهارم میسوزونیم، بار 5م از گروه اخراج میشید)
😡  کسایی که اهل تقلب هستن :  فتوشاپ میکنن، ریپ رو جاهای دیگه فور میدن،  در کانالی غیر از کانال های اعلامی تبلیغ رو درج میکنن، ویو فیک میزنن و ... زودتر از اونی که بفهمید شناسایی می شید و از تمامی گسترده ها محروم میشید`,
  welcome:`خوش اومدین☺️، از دکمه منو برای دسترسی به گزینه های ربات استفاده کن. اول از همه دکمه ثبت کانال رو بزن و کانال های خودتو ثبت کن`,
  setusername:` دوست عزیز شما برای خودت آیدی تلگرام نداری. لطفا اول واسه خودت آیدی بساز و بعد مشخصات کارتت رو ثبت کن.
 اگه بلد نیستی برای خودت آی دی بسازی دستور العمل این سایت ( http://goo.gl/inqCti ) رو یه نگاهی بنداز.
 بعدش دوباره /start رو بزن`,
  sharenumber:`لطفا شمارتو باهام به اشتراک بزار تا بتونیم در مواقع ریپورتی باهم ارتباط برقرار کنیم `,
  name:` لطفا نام خود را به حروف فارسی وارد کنید `,
  sentmessage:` پیام شما برای مدیر ارسال شد`,
  sendmessage:` پیام خود را وارد کنید `,
categories:`موضوع کانال خودتو انتخاب کن، حداکثر  1موضوع رو میتونی انتخاب کنی`,
tag:`دوستم یه چندتا گزینه ازت میخوام لطفا کامل وارد کن. فقط حواست باشه تگ کانال دیگران رو ثبت نزنی چون توسط مدیریت بلاک میشی و از ربات دیگه نمیتونی استفاده کنی

لطفا تگ کانالت رو وارد کن
نمونه :
@raaz_co`,
  cardno:`شماره کارتت رو وارد کن، شماره کارت رو به حالت نمونه وارد کن
 (16 رقم به هم پیوسته و بدون هیچ گونه فاصله(
  نمونه : 1111222233334444
`,
  shebano:`شماره شباتو وارد کن، برای گرفتن شماره شبا باید حتما شماره حساب داشته باشی (تو اس ام اس هایی که از سمت بانک میاد شماره حسابت هست). اگه بلد نیستی شماره شبا بگیری رو لینک زیر کلیک کن و با مرورگر کوشیت بازش کن:  http://goo.gl/ozNpBU
شماره شبا رو حتما به فرمت زیر وارد کن: (با IR بزرگ شروع بشه و بدون فاصله 24 رقم بعدش وارد بشه) IR410170000000316128689002
`,

  newcardno:`
اگه شماره کارتت رو میخوای تغییر بدی شماره کارت جدیدت رو وارد کن
، شماره کارت رو به حالت نمونه وارد کن

 (16 رقم به هم پیوسته و بدون هیچ گونه فاصله(
  نمونه : 1111222233334444
`,

  panel:` پنل کاربری`,
wrong:` مقدار ورودی اشتباه است  \r\n `,
  takeonecategory:` موضوع کانال خودتو انتخاب کن، حداکثر 1 موضوع رو میتونی انتخاب کنی`,
  categorybeforeadded:`
  این دسته بندی قبلا انتخاب شده است`,
  transactionopen:` تراکنش باز برای این کانال وجود دارد`,
  waitforverify:` کانال شما با موفقیت ثبت شد، منتظر تایید مدیر باشید
اگه کانال دیگه ای هم داری میتونی از طریق ثبت کانال کانال دیگتو هم ثبت بزنی `,
  channelpending:`کانال شما توسط ادمین تایید نشده است ، لطفا منتظر تایید مدیر باشید`,
  channelnotexist:` کانالی برای شما وجود ندارد`,
  transactionnotexist:` تراکنشی برای کانال شما وجود ندارد`,
  channellist:`لیست کانال های شما`,
  duplicatechannel:`شرمندت شدم. پیش از این کسی این تگ کانال رو ثبت زده . اگه با این قضیه مشکل داری واسه مدیریت پیام بفرست
  نام کاربری که کانال ثبت کرده : @~username
  شماره کارتی که که برای کانال ثبت شده : ~cardno`,
blockchannel:`شرمندت شدم. پیش از این کسی این تگ کانال رو ثبت زده . اگه با این قضیه مشکل داری واسه مدیریت پیام بفرست `,
  channeloprations:`
  کانال تگ: ~tag
  شماره کارت: ~cardno
  شماره شبا: ~shebano
  نام صاحب حساب: ~cardname
  نوع پرداخت: ~setltype
  دسته بندی: ~categories
  `,
  actiondone:` عملیات انجام شد `,

  otherchannels:`اگر تبلیغات رو مشترک با کانالهای دیگه ای تبلیغتو میزنی تگ کانالهای دیگتو هم وارد کن
در غیر این صورت روی دکمه شیشه ای زیر کلیک کن 👇`,
      eidtotherchannels:`اگر تبلیغات رو مشترک با کانالهای دیگه ای تبلیغتو میزنی تگ کانالهای دیگتو هم وارد کن
در غیر این صورت روی دکمه منو زیر کلیک کن 👇`,
  setltype:` درامد شما چند روز یکبار تسویه شود؟ توجه کنید درصورتیکه زودترین زمان ممکن را انتخاب کنید حداقل مجموع درامد شما ۱۵ هزار تومان باید باشد که بتوانیم ان را تسویه کنیم. `,
 newsetltype:`دوست عزیز #توجه کن در صورتی که فرآیند ویرایشت تکمیل نشه هیچ گزارش عملکردی واست ارسال نمیشه
 هر موقع منصرف شدی دکمه ی منو رو بزن
 ازت میخوام اطلاعات جدید کانالتو وارد کنی
 درامد شما چند روز یکبار تسویه شود؟ توجه کنید درصورتیکه زودترین زمان ممکن را انتخاب کنید حداقل مجموع درامد شما ۱۵ هزار تومان باید باشد که بتوانیم ان را تسویه کنیم. `,
  cardname:` نام و نام خانوادگی صاحب کارت را به فارسی و به طور #کامل وارد کنید ، اگر نام را بصورت ناقص وارد کنید در مرحله  واریز، سیستم بانکی دچار ارور شده و واریز صورت نمیگیرد `,
sharednumber:`ممنون که شمارتو با ما به اشتراک گذاشتی`,
  },
  markups:{
  menu:userbot.keyboard([
    ['منو',userbot.button('contact', ' اشتراک گذاری شماره')]
  ], { resize: true }),
justmenu:userbot.keyboard([
    ['منو']
  ], { resize: true }),
    sharenumber:
    userbot.keyboard([
    ['فعلا به اشتراک نمی گذارم',userbot.button('contact', ' اشتراک گذاری شماره')]    ]
    , {resize:true,once:true}),



  userpanel:
    userbot.inlineKeyboard([
    [
      userbot.inlineButton('ثبت کانال', { callback: 'newchannel' })]
      ,
      [userbot.inlineButton('مدیریت کانال', { callback: 'managechannel' })],
      [userbot.inlineButton('ویرایش نام', { callback: 'editname' })],
    [
      userbot.inlineButton('ارسال پیام', { callback: 'sendmessage' })
    ],

  ]),
    wait:
    userbot.inlineKeyboard([
    [
      userbot.inlineButton('تایید و ارسال ', { callback: 'wait-verify' })]
      ,
     [ userbot.inlineButton('ویرایش کانال', { callback: 'wait-edit' }),
    ],
    [
      userbot.inlineButton('بازگشت به منوی اصلی', { callback: 'wait-userpanel' })
    ],

  ]),
  categories:
  userbot.inlineKeyboard([
    [
      userbot.inlineButton('ادبی', { callback: 'categories-ادبی' }),
      userbot.inlineButton('هنری', { callback: 'categories-هنری' }),
    ],[
      userbot.inlineButton('موسیقی', { callback: 'categories-موسیقی' }),
      userbot.inlineButton('ویدیو کلیپ', { callback: 'categories-ویدیو کلیپ' }),
    ],
    [
      userbot.inlineButton('سرگرمی و جک', { callback: 'categories-سرگرمی و جک' }),
      userbot.inlineButton('ورزشی', { callback: 'categories-ورزشی' }),
    ],
    [
      userbot.inlineButton('بانوان', { callback: 'categories-بانوان' }),
      userbot.inlineButton('تاریخی', { callback: 'categories-تاریخی' }),
    ],
    [
      userbot.inlineButton('مشاوره روانشناسی', { callback: 'categories-مشاوره روانشناسی' }),
      userbot.inlineButton('خبری و سیاسی', { callback: 'categories-خبری و سیاسی' }),
    ],
    [
      userbot.inlineButton('علمی آموزشی', { callback: 'categories-علمی آموزشی' }),
      userbot.inlineButton('مذهبی', { callback: 'categories-مذهبی' }),
    ],
    [
      userbot.inlineButton('اپ موبایل', { callback: 'categories-اپ موبایل' }),
      userbot.inlineButton('فروشگاهی', { callback: 'categories-فروشگاهی' }),
    ],
    [
      userbot.inlineButton('استانی', { callback: 'categories-استانی' }),
      userbot.inlineButton('افراد مشهور', { callback: 'categories-افراد مشهور' }),
    ],
    [
      userbot.inlineButton('سازمانی', { callback: 'categories-سازمانی' }),
      userbot.inlineButton('گردشگری', { callback: 'categories-گردشگری' }),
    ],
    [
      userbot.inlineButton('رد کردن', { callback: 'categories-passed' })
    ],

  ]),
},
constants:
{
categories:['جک', 'تاریخی','بانوان', 'آموزشی', 'استانی', 'ادبی','اپ موبایل'
, 'فروشگاهی','عکس','طبیعت', 'سلامت', 'سرگرمی','رمان آنلاین', 'دانستنی', 'خبری و سیاسی',  'ورزشی', 'موسیقی', 'مشاوره', 'مذهبی', 'فیلم',
    ],
  }







};